In [28]:
import numpy as np
import pandas as pd

In [29]:
dataset = pd.read_csv("Titanic-Dataset.csv")

In [30]:
dataset.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [31]:
dataset.shape

(891, 12)

In [32]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [37]:
dataset.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Age_mean
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,29.699118
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,13.002015
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.420000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,22.000000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,29.699118
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,35.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,80.000000

In [38]:
dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age_mean         0
dtype: int64

In [43]:
#Since Age column has many NULL values, we fill it with the median to increase accuracy
dataset['Age_mean'] = dataset['Age'].fillna(dataset['Age'].mean())
dataset[['Age_mean','Age']]

      Age_mean   Age
0    22.000000  22.0
1    38.000000  38.0
2    26.000000  26.0
3    35.000000  35.0
4    35.000000  35.0
..         ...   ...
886  27.000000  27.0
887  19.000000  19.0
888  29.699118   NaN
889  26.000000  26.0
890  32.000000  32.0

[891 rows x 2 columns]

In [49]:
from sklearn.preprocessing import LabelEncoder

In [53]:
#Transforming and preprocessing where needed
le = LabelEncoder()
dataset['Sex'] = le.fit_transform(dataset['Sex'])
dataset['Embarked'] = le.fit_transform(dataset['Embarked'])
dataset['Cabin'] = le.fit_transform(dataset['Cabin'])
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_mean
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,147,2,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,81,0,38.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,147,2,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,55,2,35.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,147,2,35.0

In [111]:
#Defining the input feature and target feature
x = dataset[['Sex','Age_mean','SibSp','Pclass','Parch','Fare']]
y = dataset['Survived']

In [112]:
#importing the train_test_split 
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,random_state = 50 ,test_size = 0.3)

# LOGISTIC REGRESSION

In [113]:
#importing LogisticRegression library and fitting the model
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(x_train,y_train)

LogisticRegression()

In [114]:
y_pred = lr.predict(x_test)

In [129]:
#accuracy score for Logistic regression
from sklearn.metrics import accuracy_score
score = accuracy_score(y_test,y_pred)
print("Accuracy for Logistic Regression is:",score*100,"%")

Accuracy for Logistic Regression is: 80.97014925373134 %

In [130]:
#confusion matrix for logistic regression
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test,y_pred)
print("confusion matrix for Logstic Regression is:\n",cm)

confusion matrix for Logstic Regression is:
 [[144  18]
 [ 33  73]]

In [131]:
#Classification report for Logistic Regression
from sklearn.metrics import classification_report
cr = classification_report(y_test,y_pred)
print("classification_report for Logistic Regression is:\n",cr)

classification_report for Logistic Regression is:
               precision    recall  f1-score   support

           0       0.81      0.89      0.85       162
           1       0.80      0.69      0.74       106

    accuracy                           0.81       268
   macro avg       0.81      0.79      0.80       268
weighted avg       0.81      0.81      0.81       268

# RANDOM FOREST

In [117]:
#importing Random forest library and fitting the model
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier(n_estimators = 200)
rf.fit(x_train,y_train)

RandomForestClassifier(n_estimators=200)

In [118]:
rf_y_pred=rf.predict(x_test)

In [135]:
#accuracy score for Random forest
score_rf = accuracy_score(y_test,rf_y_pred)
print("Accuracy for Random Forest is:",score_rf*100,"%")

Accuracy for Random Forest is: 80.22388059701493 %

In [134]:
#confusion matrix for random forest
rf_cm = confusion_matrix(y_test, rf_y_pred)
print("confusion matrix for Random Forest is:\n",rf_cm)

confusion matrix for Random Forest is:
 [[143  19]
 [ 34  72]]

In [136]:
#Classification report for random forest
rf_cr = classification_report(y_test,rf_y_pred)
print("classification_report for Random Forest is:\n",rf_cr)

classification_report for Random Forest is:
               precision    recall  f1-score   support

           0       0.81      0.88      0.84       162
           1       0.79      0.68      0.73       106

    accuracy                           0.80       268
   macro avg       0.80      0.78      0.79       268
weighted avg       0.80      0.80      0.80       268